import telebot
from telebot import types
from dotenv import load_dotenv
import os
import pytz

load_dotenv()

bot = telebot.TeleBot(os.getenv('TOKEN'))

from datetime import datetime
import bisect



солка22 = ["6:25", "6:50", "7:15", "7:40", "8:05", "8:30", "8:55", "9:20", "9:45", "10:55", "11:45", "12:10", "12:35",
           "13:00", "13:25", "13:50", "14:15", "14:40", "15:05", "15:55", "16:45", "17:10", "17:35", "18:00", "18:45",
           "19:05", "19:55", "20:45", "21:35", "22:25"]

предм22 = ["6:40", "7:05", "7:30", "7:55", "8:20", "8:45", "9:10", "9:35", "10:00", "11:10", "12:00", "12:25", "12:50",
           "13:15", "13:40", "14:05", "14:30", "14:55", "15:20", "16:10", "17:00", "17:25", "17:50", "18:15", "19:00",
           "19:20", "20:10", "21:00", "21:50", "22:40"]

вок22 =   ["5:35", "6:00", "6:25", "6:50", "7:15", "7:40", "8:05", "8:30", "8:55", "9:20", "9:45", "11:20", "11:45",
           "12:10", "12:35", "13:00", "13:25", "13:50", "14:15", "14:40", "15:30", "16:20", "16:45", "17:10", "17:35",
           "18:00", "18:25", "19:10", "19:30", "20:20", "21:10", "22:00", "22:50"]

полит22 = ["5:45", "6:10", "6:35", "7:00", "7:25", "7:50", "8:15", "8:40", "9:05", "9:30", "9:55", "11:30", "11:55",
           "12:20", "12:45", "13:10", "13:35", "14:00", "14:25", "14:50", "15:40", "16:30", "16:55", "17:20", "17:45",
           "18:10", "18:35", "19:20", "19:40", "20:30", "21:20", "22:10", "23:00"]

пос22_1 =   ["6:00", "6:25", "6:50", "7:15", "7:40", "8:05", "8:30", "8:55", "9:20", "9:45", "10:10", "11:45", "12:10",
             "12:35", "13:00", "13:25", "13:50", "14:15", "14:40", "15:05", "15:55", "16:45", "17:10", "17:35", "18:00",
             "18:25", "18:50", "19:35", "19:55", "20:45", "21:35", "22:25"]

полит22_1 = ["6:10", "6:35", "7:00", "7:25", "7:50", "8:15", "8:40", "9:05", "9:30", "9:55", "10:20", "11:55", "12:20",
             "12:45", "13:10", "13:35", "14:00", "14:25", "14:50", "15:15", "16:05", "16:55", "17:20", "17:45", "18:10",
             "18:35", "19:00", "19:45", "20:05", "20:55", "21:45", "22:35"]

вок22_1 =   ["6:20", "6:45", "7:10", "7:35", "8:00", "8:25", "8:50", "9:15", "10:25", "11:15", "11:40", "12:05", "12:30",
             "12:55", "13:20", "13:45", "14:10", "14:35", "15:00", "15:25", "16:15", "17:05","17:30", "17:55", "18:20",
             "18:45", "19:10", "20:15", "21:05", "21:55"]

предм22_1 = ["6:30", "6:55", "7:20", "7:45", "8:10", "8:35", "9:00", "9:25", "10:35", "11:25", "11:50", "12:15", "12:40",
             "13:05", "13:30", "13:55", "14:20", "14:45", "15:10", "15:35", "16:25", "17:15", "17:40", "18:05", "18:30",
             "18:55", "19:20", "20:25", "21:15", "22:05"]



солка20 = ["6:26", "6:46", "7:06", "7:30", "7:50", "8:08", "8:40", "9:00", "9:18", "9:32", "10:40", "11:00", "11:20",
           "11:44", "12:04", "12:26", "12:46", "13:10", "13:26", "13:46", "14:10", "14:29", "14:49", "15:15", "15:37",
           "16:08", "16:20", "16:42", "17:08", "17:33", "18:00", "18:32", "19:00", "19:28", "20:00", "20:29", "21:00"]

предм20 = ["06:41", "07:01", "07:21", "07:45", "08:05", "08:21", "08:55", "09:15", "09:31", "09:47", "10:55", "11:15",
           "11:35", "11:59", "12:19", "12:41", "13:01", "13:25", "13:41", "14:01", "14:25", "14:44", "15:04", "15:30",
           "15:51", "16:23", "16:35", "16:57", "17:23", "17:48", "18:15", "18:47", "19:15", "19:43", "20:15", "20:44",
           "21:15"]

сосно20_1 = ["6:58", "7:17", "7:38", "8:02", "8:22", "8:48", "9:12", "9:30", "9:48", "10:10", "11:12", "11:32", "11:56",
             "12:15", "12:35", "12:56", "13:16", "13:40", "13:57", "14:18", "14:42", "15:06", "15:22", "15:47", "16:10",
             "16:38", "16:52", "17:17", "17:50", "18:03", "18:30", "19:03", "19:30", "19:59", "20:30", "21:00", "21:30"]

предм20_1 = ["07:13", "07:33", "07:53", "08:17", "08:37", "09:01", "09:27", "09:45", "10:01", "10:25", "11:17", "11:47",
             "12:11", "12:30", "12:50", "13:11", "13:31", "13:55", "14:12", "14:33", "14:57", "15:21", "15:37", "16:02",
             "16:25", "16:53", "17:07", "17:32", "18:05", "18:17", "18:45", "19:18", "19:45", "20:14", "20:45", "21:15",
             "21:45"]


солка21вых = ["6:17", "6:40", "7:05", "7:20", "7:40", "7:53", "8:10", "8:27", "8:40", "8:55", "9:07", "9:30", "9:45", "10:02",
"10:20", "10:37", "11:08", "11:32", "11:49", "12:15", "12:25", "12:40", "12:55", "13:15", "13:33", "13:52", "14:07", "14:21",
"14:34", "14:53", "15:05", "15:30", "15:50", "16:15", "16:34", "16:52", "17:11", "17:31", "17:41", "17:55", "18:12", "18:28",
"18:52", "19:20", "19:55", "20:35", "21:40"]

мелька21вых = ["6:30", "6:50", "7:05", "7:20", "7:35", "7:55", "8:15", "8:27", "8:42", "8:57", "9:20", "9:45", "10:02", "10:21",
"10:45", "11:00", "11:20", "11:46", "12:00", "12:20", "12:30", "12:40", "13:02", "13:25", "13:45", "14:02", "14:22", "14:42",
"15:00", "15:16", "15:25", "15:44", "16:05", "16:20", "16:40", "17:01", "17:14", "17:26", "18:20", "18:50", "19:04",
"19:45", "20:10", "20:47", "21:23"]

солка21 = ["6:20", "6:40", "6:50", "7:00", "7:10", "7:20", "7:30", "7:39", "7:50", "8:00", "8:10", "8:21", "8:31", "8:40",
"8:48", "8:58", "9:07", "9:15", "9:23", "9:33", "9:43", "9:53", "10:05", "10:20", "10:33", "10:47", "11:02", "11:20", "11:32",
"11:40", "11:50", "12:04", "12:15", "12:24", "12:34", "12:43", "12:53", "13:05", "13:22", "13:33", "13:44", "14:00", "14:10",
"14:22", "14:34", "14:44", "14:54", "15:03", "15:13", "15:21", "15:30", "15:40", "15:51", "15:58", "16:05", "16:15", "16:25",
"16:34", "16:43", "16:51", "17:01", "17:11", "17:20", "17:31", "17:39", "17:48", "17:56", "18:03", "18:14", "18:30", "18:43",
"18:55", "19:20", "19:42", "20:17", "21:05", "22:04"]

мелька21 = ["6:20", "6:40", "6:50", "7:00", "7:10", "7:20", "7:30", "7:40", "7:50", "8:00", "8:07", "8:17", "8:24", "8:34",
"8:43", "8:53", "9:03", "9:13", "9:23", "9:33", "9:43", "9:53", "10:03", "10:15", "10:29", "10:44", "10:59", "11:10", "11:23",
"11:34", "11:44", "11:52", "12:02", "12:11", "12:20", "12:32", "12:40", "12:50", "13:01", "13:11", "13:25", "13:34", "13:43",
"13:53", "14:02", "14:11", "14:21", "14:31", "14:40", "14:49", "15:04", "15:15", "15:25", "15:34", "15:46", "15:55", "16:02",
"16:11", "16:20", "16:30", "16:42", "16:52", "17:00", "17:07", "17:15", "17:24", "17:33", "17:41", "17:51", "18:05", "18:20", "18:35",
"18:53", "19:07", "19:18", "19:30", "19:45", "20:10", "20:32", "21:10", "21:56"]

@bot.message_handler(commands=['start'])
def start(message):
    mess = (f'Приветствую вас , <b>{message.from_user.first_name}</b> 👋 . Тут вы можете найти все расписание города,'
            f'района, а так же пригородное и междугородное расписание. Используйте кнопу меню, чтобы найти нужный вам'
            f'маршрут')
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True, selective=True)
    button1 = types.KeyboardButton("🚍 Меню 🚍")
    keyboard.add(button1)
    bot.reply_to(message, mess, reply_markup=keyboard, parse_mode='html')

@bot.message_handler(func=lambda message: message.text == '🚍 Меню 🚍')
def menu(message):
    mess = ('⬇️ Выберите пункт ⬇️')
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True, selective=True)
    button1 = types.KeyboardButton('📜 Расписание')
    button2 = types.KeyboardButton('🚌 Ближайший автобус')
    button3 = types.KeyboardButton('❓ Как доехать до остановки')
    keyboard.row(button1, button2).add(button3)
    bot.reply_to(message, mess, reply_markup=keyboard)

@bot.message_handler(func=lambda message: message.text == '📜 Расписание')
def raspisanie(message):
    mess = ('⬇️ Выберите категорию маршрутов ⬇️')
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True, selective=True)
    button1 = types.KeyboardButton("🟢Городские")
    button2 = types.KeyboardButton("🟢Пригородные")
    button3 = types.KeyboardButton("🟢Междугородные")
    button4 = types.KeyboardButton("🟢Иланск")
    button5 = types.KeyboardButton("🟢Красноярск-восток")
    button6 = types.KeyboardButton("🚍 Меню 🚍")
    keyboard.row(button1, button2).add(button3, button4).add(button5, button6)
    bot.reply_to(message, mess, reply_markup=keyboard)

@bot.message_handler(func=lambda message: message.text == '🟢Городские')
def raspisanie(message):
    mess = ('⬇️ Выберите маршрут ⬇️')
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True, selective=True)
    button1 = types.KeyboardButton("1️⃣")
    button2 = types.KeyboardButton("3️⃣")
    button3 = types.KeyboardButton("5️⃣")
    button4 = types.KeyboardButton("8️⃣")
    button5 = types.KeyboardButton("9️⃣")
    button6 = types.KeyboardButton("1️⃣0️⃣")
    button7 = types.KeyboardButton("1️⃣3️⃣")
    button8 = types.KeyboardButton("1️⃣️️5️⃣")
    button9 = types.KeyboardButton("1️⃣7️⃣")
    button10 = types.KeyboardButton("1️⃣9️⃣")
    button11 = types.KeyboardButton("2️⃣0️⃣")
    button12 = types.KeyboardButton("2️⃣1️⃣")
    button13 = types.KeyboardButton("2️⃣2️⃣")
    button14 = types.KeyboardButton("2️⃣3️⃣")
    button15 = types.KeyboardButton("2️⃣4️⃣")
    button16 = types.KeyboardButton("1️⃣0️⃣3️⃣")
    button17 = types.KeyboardButton("1️⃣0️⃣4️⃣")
    button18 = types.KeyboardButton("1️⃣0️⃣️5️⃣")
    button19 = types.KeyboardButton("1️⃣1️⃣8️⃣")
    button20 = types.KeyboardButton("1️⃣1️⃣9️⃣")
    button21 = types.KeyboardButton("1️⃣2️⃣2️⃣")
    button22 = types.KeyboardButton("📜 Расписание")
    button23 = types.KeyboardButton("🚍 Меню 🚍")
    keyboard.add(button1, button2, button3, button4,  button5,  button6,  button7,  button8,  button9, button10,
                 button11, button12, button13,  button14,  button15,  button16,  button17, button18, button19, button20,
                 button21, button22,  button23)
    bot.reply_to(message, mess, reply_markup=keyboard)

@bot.message_handler(func=lambda message: message.text == '🚌 Ближайший автобус')
def bas(message):
    mess = ('⬇️ Выберите маршрут ⬇️')
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True, selective=True)
    button1 = types.KeyboardButton("Ближайший 20")
    button2 = types.KeyboardButton("Ближайший 21")
    button3 = types.KeyboardButton("Ближайший 22")
    button4 = types.KeyboardButton("🚍 Меню 🚍")
    keyboard.row(button1, button2).add(button3, button4)
    bot.reply_to(message, mess, reply_markup=keyboard)

@bot.message_handler(func=lambda message: message.text == '↩️ Назад')
def назад(message):
    mess = ('⬇️ Выберите маршрут ⬇️')
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True, selective=True)
    button1 = types.KeyboardButton("Ближайший 20")
    button2 = types.KeyboardButton("Ближайший 21")
    button3 = types.KeyboardButton("Ближайший 22")
    button4 = types.KeyboardButton("🚍 Меню 🚍")
    keyboard.row(button1, button2).add(button3, button4)
    bot.reply_to(message, mess, reply_markup=keyboard)

@bot.message_handler(func=lambda message: message.text == 'Ближайший 20')
def ближайший_21(message):
    mess = ('⬇️ Выберите остановку ⬇️')
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True, selective=True)
    button1 = types.KeyboardButton("Солнечный 20")
    button2 = types.KeyboardButton("Предмостная 20")
    button3 = types.KeyboardButton("Сосновый")
    button4 = types.KeyboardButton("↩️ Назад")
    button5 = types.KeyboardButton("🚍 Меню 🚍")
    keyboard.row(button1, button2, ).add(button3, button4).add(button5)
    bot.reply_to(message, mess, reply_markup=keyboard)

@bot.message_handler(func=lambda message: message.text == 'Ближайший 21')
def ближайший_21(message):
    mess = ('⬇️ Выберите остановку ⬇️')
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True, selective=True)
    button1 = types.KeyboardButton("Солнечный 21")
    button2 = types.KeyboardButton("Мелькомбинат")
    button3 = types.KeyboardButton("↩️ Назад")
    button4 = types.KeyboardButton("🚍 Меню 🚍")
    keyboard.row(button1, button2).add(button3, button4)
    bot.reply_to(message, mess, reply_markup=keyboard)

@bot.message_handler(func=lambda message: message.text == 'Ближайший 22')
def ближайший_22(message):
    mess = ('⬇️ Выберите остановку ⬇️')
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True, selective=True)
    button1 = types.KeyboardButton("Солнечный 22")
    button2 = types.KeyboardButton("Предмостная 22")
    button3 = types.KeyboardButton("Вокзал 22")
    button4 = types.KeyboardButton("Политехнический")
    button5 = types.KeyboardButton("Строителей")
    button6 = types.KeyboardButton("↩️ Назад")
    button7 = types.KeyboardButton("🚍 Меню 🚍")
    keyboard.row(button1, button2).add(button3, button4).add(button5, button6).add(button7)
    bot.reply_to(message, mess, reply_markup=keyboard)

@bot.message_handler(content_types=["text"])
def send_message(message):

    if message.text.lower() == ('❓ как доехать до остановки'):
        mess = (f'Вот весь список остановок на которые я могу дать ответ. Пришлите мне нужную вам остановку из списка и '
                f'напишите ее так же как написано там, не учитывая скобки: солнечный, '
                f'МЖК, Северо-Западный, ремзавод, стадион текстильщик, драм театр (Порт - Артур), восход, предмостная, '
                f'золотой ключик (набережная), лицей 1, магазин геолог, школа 15, нефтебаза, туб.санаторий, сосновый, '
                f'семиполатинский ЛЗУ (АО "КрасЭко"), Ново-Канский ЛПХ, стрижевой, ДРСУ-3, подсобное, агроснаб, соленое, '
                f'абанское кладбище, Пед.колледж, стариково, черемушки, ДСУ-4, ДОСААФ, ЗЛМК, ККЗ, Анцирь, Чечеул, Зеленый Луг, '
                f'Новый Путь, строителей, школа 8, краевая(гавань), БХЗ, гор.больница, Политехнический, ГИБДД, автоколона 1261, '
                f'5 городок, 4 городок, ПАТП, мелькомбинат, Эйдемана, гор.сад, площадь Коростелева, Ж/Д вокзал(автовокзал), '
                f'кинотеатр Космос, кинотеатр Север, детская больница(север), СИЗО, мясокомбинат, коллекторная ул., кан, рассвет, '
                f'бережки, левобережное, Бражное, Филимоново, Сухая речка')
        bot.reply_to(message, mess, parse_mode='html')

    if message.text.lower() == ('солнечный'):
        mess = (f'Доехать до остановки "солнечный" можно на маршрутах: 1, 4а, 10, 17, 20, 21, 22, 23, 25, 103, 103у, 104, 118, 119. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('солнечный'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDssv8jS")

    if message.text.lower() == ('мжк'):
        mess = (f'Доехать до остановки "мжк" можно на маршрутах: 1, 4а, 10, 17, 20, 21, 22, 23, 25, 103, 103у, 104, 118, 119. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('мжк'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTBN4W")

    if message.text.lower() == ('северо-западный'):
        mess = (f'Доехать до остановки "Северо-Западный" можно на маршрутах: 1, 4а, 10, 17, 20, 21, 22, 23, 25, 103, 103у, 104, 118, 119. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('северо-западный'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTFY4b")

    if message.text.lower() == ('ремзавод'):
        mess = (f'Доехать до остановки "ремзавод" можно на маршрутах: 1, 4, 4а, 6, 10, 14, 15, 17, 19, 20, 21, 22, 23, '
                f'25, 103, 103у, 104, 118, 119, 122. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('ремзавод'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTJD1x")

    if message.text.lower() == ('стадион текстильщик'):
        mess = (f'Доехать до остановки "стадион текстильщик" можно на маршрутах: 1, 4, 4а, 6, 10, 14, 15, 17, 19, 20, 21, 22, 23, '
                f'25, 103, 103у, 104, 118, 119, 122. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('стадион текстильщик'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTNNyC")

    if message.text.lower() == ('драм театр'):
        mess = (f'Доехать до остановки "драм театр" можно на маршрутах: 1, 4, 4а, 6, 10, 14, 15, 17, 19, 20, 21, 22, 23, '
                f'25, 103, 103у, 104, 118, 119, 122. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('драм театр'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTRJyj")

    if message.text.lower() == ('восход'):
        mess = (f'Доехать до остановки "восход" можно на маршрутах: 1, 4, 4а, 6, 10, 14, 15, 17, 19, 20, 21, 22, 23, '
                f'25, 103, 103у, 104, 118, 119, 122. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('восход'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTR0p-")

    if message.text.lower() == ('предмостная'):
        mess = (f'Доехать до остановки "предмостная" можно на маршрутах: 1, 3, 4, 4а, 6, 10, 13, 14, 15, 17, 19, 20, 21,'
                f' 22, 23, 24, 25, 103, 103у, 104, 118, 119, 122. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('предмостная'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTZGO0")

    if message.text.lower() == ('золотой ключик'):
        mess = (f'Доехать до остановки "золотой ключик" можно на маршрутах: 3, 13, 20, 24'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('золотой ключик'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsT6XjJ")

    if message.text.lower() == ('лицей 1'):
        mess = (f'Доехать до остановки "лицей 1" можно на маршрутах: 3, 13, 20, 24'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('лицей 1'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTb4nB")

    if message.text.lower() == ('магазин геолог'):
        mess = (f'Доехать до остановки "магазин геолог" можно на маршрутах: 3, 13, 20, 24'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('магазин геолог'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTfEJO")

    if message.text.lower() == ('школа 15'):
        mess = (f'Доехать до остановки "школа 15" можно на маршрутах: 3, 13, 20, 24'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('школа 15'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTnEzy")

    if message.text.lower() == ('нефтебаза'):
        mess = (f'Доехать до остановки "нефтебаза" можно на маршрутах: 3, 20'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('нефтебаза'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTnHKj")

    if message.text.lower() == ('туб.санаторий'):
        mess = (f'Доехать до остановки "туб.санаторий" можно на маршрутах: 3, 20'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('туб.санаторий'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTrBiq")

    if message.text.lower() == ('сосновый'):
        mess = (f'Доехать до остановки "сосновый" можно на маршрутах: 3, 20'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('сосновый'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTrKMn")

    if message.text.lower() == ('семиполатинский лзу'):
        mess = (f'Доехать до остановки "семиполатинский ЛЗУ" можно на маршруте: 13'
                f'Чтобы посмотреть его расписание пришлите мне цифру 13. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('семиполатинский лзу'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTr2lt")

    if message.text.lower() == ('ново-канский лпх'):
        mess = (f'Доехать до остановки "Ново-Канский ЛПХ" можно на маршруте: 13'
                f'Чтобы посмотреть его расписание пришлите мне цифру 13. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('ново-канский лпх'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTvZ5r")

    if message.text.lower() == ('стрижевой'):
        mess = (f'Доехать до остановки "стрижевой" можно на маршруте: 13'
                f'Чтобы посмотреть его расписание пришлите мне цифру 13. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('стрижевой'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTv8yT")

    if message.text.lower() == ('дрсу-3'):
        mess = (f'Доехать до остановки "ДРСУ-3" можно на маршруте: 13'
                f'Чтобы посмотреть его расписание пришлите мне цифру 13. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('дрсу-3'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTvXLy")

    if message.text.lower() == ('подсобное'):
        mess = (f'Доехать до остановки "подсобное" можно на маршруте: 13'
                f'Чтобы посмотреть его расписание пришлите мне цифру 13. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('подсобное'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsTzQNq")

    if message.text.lower() == ('агроснаб'):
        mess = (f'Доехать до остановки "агроснаб" можно на маршруте: 24'
                f'Чтобы посмотреть его расписание пришлите мне цифру 24. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('агроснаб'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspIJZr")

    if message.text.lower() == ('соленое'):
        mess = (f'Доехать до остановки "соленое" можно на маршруте: 24. '
                f'Чтобы посмотреть его расписание пришлите мне цифру 24. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('соленое'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsteY1c")

    if message.text.lower() == ('абанское кладбище'):
        mess = (f'Доехать до остановки "абанское кладбище" можно на маршруте: 19'
                f'Чтобы посмотреть его расписание пришлите мне цифру 19. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('абанское кладбище'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsteVig")

    if message.text.lower() == ('пед.колледж'):
        mess = (f'Доехать до остановки "Пед.колледж" можно на маршрутах: 4, 6, 14, 15, 25, 122. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('пед.колледж'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspQTPx")

    if message.text.lower() == ('стариково'):
        mess = (f'Доехать до остановки "стариково" можно на маршрутах: 4, 25. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('стариково'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspUCyH")

    if message.text.lower() == ('черемушки'):
        mess = (f'Доехать до остановки "черемушки" можно на маршрутах: 14, 25. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('черемушки'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspYMN8")

    if message.text.lower() == ('дсу-4'):
        mess = (f'Доехать до остановки "ДСУ-4" можно на маршрутах: 6, 15, 122. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('дсу-4'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsp4LJe")

    if message.text.lower() == ('досааф'):
        mess = (f'Доехать до остановки "ДОСААФ" можно на маршрутах: 6, 15, 122. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('досааф'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspiAIQ")

    if message.text.lower() == ('злмк'):
        mess = (f'Доехать до остановки "ЗЛМК" можно на маршрутах: 6, 15, 122. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('злмк'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspiZjw")

    if message.text.lower() == ('ккз'):
        mess = (f'Доехать до остановки "ККЗ" можно на маршрутах: 6, 15, 122. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('ккз'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspiXoS")

    if message.text.lower() == ('анцирь'):
        mess = (f'Доехать до остановки "Анцирь" можно на маршруте: 122. '
                f'Чтобы посмотреть его расписание пришлите мне цифру 122. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('анцирь'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspmL8R")

    if message.text.lower() == ('чечеул'):
        mess = (f'Доехать до остановки "Чечеул" можно на маршрутах: 105, 118. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('чечеул'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspqOit")

    if message.text.lower() == ('зеленый Луг'):
        mess = (f'Доехать до остановки "Зеленый Луг" можно на маршруте: 118. '
                f'Чтобы посмотреть его расписание пришлите мне цифру 118. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('зеленый Луг'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspuUPh")

    if message.text.lower() == ('новый Путь'):
        mess = (f'Доехать до остановки "Новый Путь" можно на маршруте: 118. '
                f'Чтобы посмотреть его расписание пришлите мне цифру 118. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('новый Путь'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspyI90")

    if message.text.lower() == ('строителей'):
        mess = (f'Доехать до остановки "строителей" можно на маршруте: 22. '
                f'Чтобы посмотреть его расписание пришлите мне цифру 22. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('строителей'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspyOkX")

    if message.text.lower() == ('школа 8'):
        mess = (f'Доехать до остановки "школа 8" можно на маршруте: 9. '
                f'Чтобы посмотреть его расписание пришлите мне цифру 9. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('школа 8'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsp5CP6")

    if message.text.lower() == ('краевая'):
        mess = (f'Доехать до остановки "краевая" можно на маршруте: 9. '
                f'Чтобы посмотреть его расписание пришлите мне цифру 9. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('краевая'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspBAkO")

    if message.text.lower() == ('бхз'):
        mess = (f'Доехать до остановки "БХЗ" можно на маршрутах: 5, 9, 22, 118. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('бхз'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspVNmL")

    if message.text.lower() == ('гор.больница'):
        mess = (f'Доехать до остановки "гор.больница" можно на маршруте: 17. '
                f'Чтобы посмотреть его расписание пришлите мне цифру 17. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('гор.больница'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspV4mu")

    if message.text.lower() == ('политехнический'):
        mess = (f'Доехать до остановки "Политехнический" можно на маршрутах: 4, 4а, 5, 8, 9, 17, 21, 22, 104, 105, 118. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('политехнический'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspVIKi")

    if message.text.lower() == ('гибдд'):
        mess = (f'Доехать до остановки "ГИБДД" можно на маршрутах: 4, 4а, 21, 105.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('гибдд'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspR-n2")

    if message.text.lower() == ('автоколона 1261'):
        mess = (f'Доехать до остановки "автоколона 1261" можно на маршруте: 8.'
                f'Чтобы посмотреть его расписание пришлите мне цифру 8. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('автоколона 1261'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspZ0mb")

    if message.text.lower() == ('5 городок'):
        mess = (f'Доехать до остановки "5 городок" можно на маршруте: 8.'
                f'Чтобы посмотреть его расписание пришлите мне цифру 8. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('5 городок'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsp68jm")

    if message.text.lower() == ('4 городок'):
        mess = (f'Доехать до остановки "4 городок" можно на маршрутах: 4, 4а, 105.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('4 городок'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspbYo2")

    if message.text.lower() == ('патп'):
        mess = (f'Доехать до остановки "ПАТП" можно на маршрутах: 8, 21.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('патп'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspbT6W")

    if message.text.lower() == ('мелькомбинат'):
        mess = (f'Доехать до остановки "мелькомбинат" можно на маршрутах: 8, 21.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('мелькомбинат'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspfYNt")

    if message.text.lower() == ('эйдемана'):
        mess = (f'Доехать до остановки "Эйдемана" можно на маршрутах: 4, 4а, 5, 8, 9, 17, 21, 22, 104, 105, 118. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('эйдемана'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspfWJ8")

    if message.text.lower() == ('гор.сад'):
        mess = (f'Доехать до остановки "гор.сад" можно на маршрутах: 3а, 4, 4а, 5, 8, 9, 10, 17, 21, 22, 104, 105, 118, 119. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('гор.сад'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspjNKL")

    if message.text.lower() == ('площадь коростелева'):
        mess = (f'Доехать до остановки "Площадь Коростелева" можно на маршрутах: 1, 3, 3а, 4, 4а, 6, 8, 9, 10, 13, 14,'
                f' 15, 17, 19, 21, 22, 23, 24, 25, 103, 103у, 105, 118, 119, 122 '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('площадь коростелева'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspn2jd")

    if message.text.lower() == ('ж/д вокзал'):
        mess = (f'Доехать до остановки "ж/д вокзал" можно на маршрутах: 3, 3а, 4, 4а, 5, 6, 8, 9, 10, 13, 14,'
                f' 15, 19, 21, 22, 24, 25, 103, 103у, 104, 105, 118, 119, 122 '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('ж/д вокзал'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDspzL~M")

    if message.text.lower() == ('кинотеатр космос'):
        mess = (f'Доехать до остановки "кинотеатр Космос" можно на маршрутах: 1, 5, 10, 13, 14, 23, 103, 103у. '
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('кинотеатр космос'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDsp7SZO")

    if message.text.lower() == ('кинотеатр север'):
        mess = (f'Доехать до остановки "кинотеатр Север" можно на маршрутах: 1, 23.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('кинотеатр север'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstAM2e")

    if message.text.lower() == ('детская больница'):
        mess = (f'Доехать до остановки "детская больница" можно на маршрутах: 10, 103, 103у, 119.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('детская больница'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstAS-~")

    if message.text.lower() == ('сизо'):
        mess = (f'Доехать до остановки "СИЗО" можно на маршрутах: 5, 23.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('сизо'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstEUPb")

    if message.text.lower() == ('мясокомбинат'):
        mess = (f'Доехать до остановки "мясокомбинат" можно на маршрутах: 5, 23.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('мясокомбинат'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstEG-Q")

    if message.text.lower() == ('коллекторная ул.'):
        mess = (f'Доехать до остановки "коллекторная ул." можно на маршрутах: 1, 10, 119.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('коллекторная ул.'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstIYyL")

    if message.text.lower() == ('кан'):
        mess = (f'Доехать до остановки "кан" можно на маршрутах: 5, 23.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('кан'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstID35")

    if message.text.lower() == ('рассвет'):
        mess = (f'Доехать до остановки "рассвет" можно на маршрутах: 10, 119.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('рассвет'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstMY0r")

    if message.text.lower() == ('бережки'):
        mess = (f'Доехать до остановки "бережки" можно на маршруте: 119.'
                f'Чтобы посмотреть его расписание пришлите мне цифру 119. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('бережки'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstM621")

    if message.text.lower() == ('левобережное'):
        mess = (f'Доехать до остановки "левобережное" можно на маршруте: 119.'
                f'Чтобы посмотреть его расписание пришлите мне цифру 119. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('левобережное'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstMXjv")

    if message.text.lower() == ('бражное'):
        mess = (f'Доехать до остановки "Бражное" можно на маршруте: 104.'
                f'Чтобы посмотреть его расписание пришлите мне цифру 104. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('бражное'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstQNJB")

    if message.text.lower() == ('филимоново'):
        mess = (f'Доехать до остановки "Филимоново" можно на маршрутах: 103, 103у.'
                f'Чтобы посмотреть их расписание пришлите мне нужный вам № маршрута. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('филимоново'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstUENB")

    if message.text.lower() == ('сухая речка'):
        mess = (f'Доехать до остановки "Сухая речка" можно на маршруте: 103.'
                f'Чтобы посмотреть его расписание пришлите мне цифру 103. Чтобы посмотреть где находится на карте '
                f'данная остановка, нажмите на геометку ниже')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('сухая речка'):
        bot.reply_to(message, "https://yandex.ru/maps/-/CDstUH0L")

    tz = pytz.timezone('Etc/GMT-7')
    date_now = datetime.now(tz)
    now = date_now.strftime("%H:%M")
    time = datetime.strptime(now, "%H:%M")

    time22с = [datetime.strptime(temp, "%H:%M") for temp in солка22]

    ind = bisect.bisect_right(time22с, time)
    if ind < len(солка22):
         солнечный22 = f"Ближайший 22 в {солка22[ind]}"
    else:
         солнечный22 = "нет ближайшего времени"


    time22п = [datetime.strptime(temp, "%H:%M") for temp in предм22]

    ind = bisect.bisect_right(time22п, time)
    if ind < len(предм22):
         канпер22 = f"Ближайший 22 в {предм22[ind]} - направление солнечный - п. Строителей"
    else:
         канпер22 = "нет ближайшего времени"

    time22в = [datetime.strptime(temp, "%H:%M") for temp in вок22]

    ind = bisect.bisect_right(time22в, time)
    if ind < len(вок22):
         вокзал22 = f"Ближайший 22 в {вок22[ind]} - направление солнечный - п. Строителей"
    else:
         вокзал22 = "нет ближайшего времени"

    time22пол = [datetime.strptime(temp, "%H:%M") for temp in полит22]

    ind = bisect.bisect_right(time22пол, time)
    if ind < len(полит22):
         политех22 = f"Ближайший 22 в {полит22[ind]} - направление солнечный - п. Строителей"
    else:
         политех22 = "нет ближайшего времени"

    time22_1 = [datetime.strptime(temp, "%H:%M") for temp in пос22_1]

    ind = bisect.bisect_right(time22_1, time)
    if ind < len(пос22_1):
         поселок22_1 = f"Ближайший 22 в {пос22_1[ind]}"
    else:
         поселок22_1 = "нет ближайшего времени"

    time22_1пол = [datetime.strptime(temp, "%H:%M") for temp in полит22_1]

    ind = bisect.bisect_right(time22_1пол, time)
    if ind < len(полит22_1):
         политех22_1 = f"Ближайший 22 в {полит22_1[ind]} - направление п. Строителей - солнечный"
    else:
         политех22_1 = "нет ближайшего времени"

    time22_1в = [datetime.strptime(temp, "%H:%M") for temp in вок22_1]

    ind = bisect.bisect_right(time22_1в, time)
    if ind < len(вок22_1):
         вокзал22_1 = f"Ближайший 22 в {вок22_1[ind]} - направление п. Строителей - солнечный"
    else:
         вокзал22_1 = "нет ближайшего времени"

    time22_1п = [datetime.strptime(temp, "%H:%M") for temp in предм22_1]

    ind = bisect.bisect_right(time22_1п, time)
    if ind < len(предм22_1):
         канпер22_1 = f"Ближайший 22 в {предм22_1[ind]} - направление п. Строителей - солнечный"
    else:
         канпер22_1 = "нет ближайшего времени"



    if message.text.lower() == ('ближайший 22'):
        mess = (f'Выберите остановку и напишите ее так же как написано тут: солнечный 22, предмостная 22, вокзал 22,'
                f' политехнический, строителей')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('солнечный 22'):
        bot.reply_to(message, солнечный22)
    if message.text.lower() == ('предмостная 22'):
        bot.reply_to(message, канпер22)
    if message.text.lower() == ('предмостная 22'):
        bot.reply_to(message, канпер22_1)
    if message.text.lower() == ('вокзал 22'):
        bot.reply_to(message, вокзал22)
    if message.text.lower() == ('вокзал 22'):
        bot.reply_to(message, вокзал22_1)
    if message.text.lower() == ('политехнический'):
        bot.reply_to(message, политех22)
    if message.text.lower() == ('политехнический'):
        bot.reply_to(message, политех22_1)
    if message.text.lower() == ('строителей'):
        bot.reply_to(message, поселок22_1)

    date_now = datetime.now()
    now = date_now.strftime("%H:%M")
    time = datetime.strptime(now, "%H:%M")

    time20с = [datetime.strptime(temp, "%H:%M") for temp in солка20]

    ind = bisect.bisect_right(time20с, time)
    if ind < len(солка20):
         солнечный20 = f"Ближайший 20 в {солка20[ind]}"
    else:
         солнечный20 = "нет ближайшего времени"

    time20п = [datetime.strptime(temp, "%H:%M") for temp in предм20]

    ind = bisect.bisect_right(time20п, time)
    if ind < len(предм20):
         канпер20 = f"Ближайший 20 в {предм20[ind]} - направление солнечный - сосновый"
    else:
         канпер20 = "нет ближайшего времени"

    time20_1 = [datetime.strptime(temp, "%H:%M") for temp in сосно20_1]

    ind = bisect.bisect_right(time20_1, time)
    if ind < len(сосно20_1):
         сосновый20_1 = f"Ближайший 20 в {сосно20_1[ind]}"
    else:
         сосновый20_1 = "нет ближайшего времени"

    time20_1п = [datetime.strptime(temp, "%H:%M") for temp in предм20_1]

    ind = bisect.bisect_right(time20_1п, time)
    if ind < len(предм20_1):
         канпер20_1 = f"Ближайший 20 в {предм20_1[ind]} - направление сосновый - солнечный"
    else:
         канпер20_1 = "нет ближайшего времени"

    if message.text.lower() == ('ближайший 20'):
        mess = (f'Выберите остановку и напишите ее так же как написано тут: солнечный 20, предмостная 20, сосновый')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('солнечный 20'):
        bot.reply_to(message, солнечный20)
    if message.text.lower() == ('предмостная 20'):
        bot.reply_to(message, канпер20)
    if message.text.lower() == ('сосновый'):
        bot.reply_to(message, сосновый20_1)
    if message.text.lower() == ('предмостная 20'):
        bot.reply_to(message, канпер20_1)


    date_now = datetime.now()
    now = date_now.strftime("%H:%M")
    time = datetime.strptime(now, "%H:%M")

    time21с = [datetime.strptime(temp, "%H:%M") for temp in солка21]

    ind = bisect.bisect_right(time21с, time)
    if ind < len(солка21):
        солнечный21 = f"Ближайший 21 в {солка21[ind]}"
    else:
        солнечный21 = "нет ближайшего времени"

    time21м = [datetime.strptime(temp, "%H:%M") for temp in мелька21]

    ind = bisect.bisect_right(time21м, time)
    if ind < len(мелька21):
        мелькомбинат21 = f"Ближайший 21 в {мелька21[ind]}"
    else:
        мелькомбинат21 = "нет ближайшего времени"

    time21_1с = [datetime.strptime(temp, "%H:%M") for temp in солка21вых]

    ind = bisect.bisect_right(time21_1с, time)
    if ind < len(солка21вых):
        солнечный21вых = f"Ближайший 21 в {солка21вых[ind]} - график выходного и праздничных дней"
    else:
        солнечный21вых = "нет ближайшего времени"

    time21_1м = [datetime.strptime(temp, "%H:%M") for temp in мелька21вых]

    ind = bisect.bisect_right(time21_1м, time)
    if ind < len(мелька21вых):
        мелькомбинат21вых = f"Ближайший 21 в {мелька21вых[ind]} - график выходного и праздничных дней"
    else:
        мелькомбинат21вых = "нет ближайшего времени"

    if message.text.lower() == ('ближайший 21'):
        mess = (f'Выберите остановку и напишите ее так же как написано тут: солнечный 21, мелькомбинат')
        bot.reply_to(message, mess, parse_mode='html')
    if message.text.lower() == ('солнечный 21'):
        bot.reply_to(message, солнечный21)
    if message.text.lower() == ('солнечный 21'):
        bot.reply_to(message, солнечный21вых)
    if message.text.lower() == ('мелькомбинат'):
        bot.reply_to(message, мелькомбинат21)
    if message.text.lower() == ('мелькомбинат'):
        bot.reply_to(message, мелькомбинат21вых)

    if message.text.lower() == ('ближайший автобус солнечный'):
        bot.reply_to(message, солнечный20)
    if message.text.lower() == ('ближайший автобус солнечный'):
        bot.reply_to(message, солнечный21)
    if message.text.lower() == ('ближайший автобус солнечный'):
        bot.reply_to(message, солнечный21вых)
    if message.text.lower() == ('ближайший автобус солнечный'):
        bot.reply_to(message, солнечный22)


    if message.text.lower() == ('дачные'):
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('4.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('4.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text.lower() == ('дачные'):
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('4а.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('4а.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text.lower() == ('дачные'):
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('5.1дачные.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('5.2дачные.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text.lower() == ('дачные'):
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('6.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('6.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text.lower() == ('дачные'):
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('10.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('10.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text.lower() == ('дачные'):
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('14.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('14.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text.lower() == ('дачные'):
        bot.send_photo(message.chat.id, open('23.jpg', 'rb'), reply_to_message_id=message.message_id)

    if message.text.lower() == ('дачные'):
        bot.send_photo(message.chat.id, open('25.jpg', 'rb'), reply_to_message_id=message.message_id)


    if message.text == "1️⃣":
        bot.send_photo(message.chat.id, open('1.jpg', 'rb'), reply_to_message_id=message.message_id)
    if message.text == "3️⃣":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('3.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('3.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text == "":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('4.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('4.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text.lower() == "":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('4а.1.jpg', 'rb')),
                                              telebot.types.InputMediaPhoto(open('4а.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text == "5️⃣":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('5.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('5.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text == "":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('6.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('6.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)

    if message.text == "8️⃣":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('8.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('8.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text == "9️⃣":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('9.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('9.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text == "1️⃣0️⃣":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('10.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('10.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)

    if message.text == "1️⃣3️⃣":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('13.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('13.2.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('13.3.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text == "":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('14.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('14.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text == "1️⃣️️5️⃣":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('15.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('15.2.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('15.3.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('15.4.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text == "1️⃣7️⃣":
        bot.send_photo(message.chat.id, open('17.jpg', 'rb'), reply_to_message_id=message.message_id)
    if message.text == "1️⃣9️⃣":
        bot.send_photo(message.chat.id, open('19.jpg', 'rb'), reply_to_message_id=message.message_id)
    if message.text == "2️⃣0️⃣":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('20.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('20.2.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('20.3.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('20.4.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('20.5.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)

    if message.text == "2️⃣1️⃣":
        bot.send_photo(message.chat.id, open('21.1.jpg', 'rb'),reply_to_message_id=message.message_id)
    if message.text == "2️⃣1️⃣":
        text = f"Графики выходного дня"
        bot.send_photo(message.chat.id, open('21.2.jpg', 'rb'), caption=text, parse_mode="HTML", reply_to_message_id=message.message_id)

    if message.text == "2️⃣2️⃣":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('22.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('22.2.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('22.3.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('22.4.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text == "2️⃣3️⃣":
        bot.send_photo(message.chat.id, open('23.jpg', 'rb'), reply_to_message_id=message.message_id)
    if message.text == "2️⃣4️⃣":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('24.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('24.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text == "":
        bot.send_photo(message.chat.id, open('25.jpg', 'rb'), reply_to_message_id=message.message_id)
    if message.text == "1️⃣0️⃣3️⃣":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('103.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('103.2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text == "1️⃣0️⃣4️⃣":
        bot.send_photo(message.chat.id, open('104.jpg', 'rb'), reply_to_message_id=message.message_id)
    if message.text == "1️⃣0️⃣️5️⃣":
        bot.send_photo(message.chat.id, open('105.jpg', 'rb'), reply_to_message_id=message.message_id)
    if message.text == "1️⃣1️⃣8️⃣":
        bot.send_photo(message.chat.id, open('118.jpg', 'rb'), reply_to_message_id=message.message_id)
    if message.text == "1️⃣1️⃣9️⃣":
        bot.send_photo(message.chat.id, open('119.jpg', 'rb'), reply_to_message_id=message.message_id)
    if message.text == "1️⃣2️⃣2️⃣":
        bot.send_photo(message.chat.id, open('122.jpg', 'rb'), reply_to_message_id=message.message_id)
    if message.text.lower() == "🟢пригородные":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('141.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('141.2.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('141.3.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('141.4.jpg', 'rb'),
                                                                                  caption='Маршрут Канск- Иланский')],
                                               reply_to_message_id=message.message_id)
    if message.text.lower() == "🟢пригородные":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('пригород1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('пригород2.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text.lower() == "🟢междугородные":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('межгород1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('межгород2.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('межгород3.jpg', 'rb'))],
                                               reply_to_message_id=message.message_id)
    if message.text.lower() == "🟢иланск":
        bot.send_media_group(message.chat.id, [telebot.types.InputMediaPhoto(open('иланск1.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('иланск1.2.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('иланск1.3.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('иланск2.1.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('иланск2.2.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('иланск3.jpg', 'rb')),
                                               telebot.types.InputMediaPhoto(open('иланск129.jpg', 'rb'),
                                                                                  caption='Маршруты по городу')],
                                               reply_to_message_id=message.message_id)

    if message.text.lower() == "🟢иланск":
        text = f"Маршруты Иланск - Красноярск"
        bot.send_photo(message.chat.id, open('иланск красноярск.jpg', 'rb'), caption=text, parse_mode="HTML",
                                                                             reply_to_message_id=message.message_id)

    if message.text.lower() == "🟢красноярск-восток":
        bot.send_photo(message.chat.id, open('красноярск-восток.png', 'rb'), reply_to_message_id=message.message_id)




bot.polling(none_stop=True)